app/Http/Controllers/FrontEndController.php

    public function priceOnOff($value) {

    $user = Auth::user()->id;
    $userTb = User::findOrFail($user);

    $userTb->update([
        'show_price' => $value,  // Use 'show_price' or 'price_show' based on your column name
    ]);
---
select * from `users` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1
update `users` set `show_price` = '0', `users`.`updated_at` = '2023-08-14 23:58:23' where `id` = 2

    public function qrsaasMode()
    {
        if (config('settings.disable_landing')) {
            //With disabled landing
            return redirect()->route('login');
        } else {
            //Normal, with landing
            $plans = Plans::get()->toArray();
---
select * from `plan` where `plan`.`deleted_at` is null

                'features'=>$features,
                'availableLanguages'=>$availableLanguages,
                'locale'=>$locale,
                'pages'=>Pages::where('showAsLink', 1)->get(),
---
select * from `pages` where `showAsLink` = 1

            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();
---
select * from `tables` where `restaurant_id` = 1