app/Http/Controllers/PlansController.php

select * from `plan` where `plan`.`deleted_at` is null
select * from `plan` where `plan`.`id` = 3 limit 1
---
    public function current()
    {

        //The curent plan -- access for owner only
        if (! auth()->user()->hasRole('owner')) {
            abort(403, 'Unauthorized action.');
        }

        // $theSelectedProcessor=strtolower(config('settings.subscription_processor','stripe'));


        // if(!($theSelectedProcessor == 'stripe' || $theSelectedProcessor == 'local')&&auth()->user()->plan_status!="set_by_admin" ){
        //     $className = '\Modules\\'.ucfirst($theSelectedProcessor).'Subscribe\Http\Controllers\App';
        //     $ref = new \ReflectionClass($className);
        //     $ref->newInstanceArgs()->validate(auth()->user());
        // }


        $plans = Plans::get()->toArray();
        $colCounter = [4, 12, 6, 4, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4];

        $currentUserPlan = Plans::withTrashed()->find(auth()->user()->mplanid());

select * from `plan` where `plan`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `plan` where `plan`.`deleted_at` is null
---
    public function index(Plans $plans)
    {
        $this->adminOnly();

        return view('plans.index', ['plans' => $plans->paginate(10)]);

insert into `plan` (`name`, `price`, `limit_items`, `description`, `features`, `period`, `enable_ordering`, `limit_orders`, `updated_at`, `created_at`) values ('test', '2', '3', 'tedst', 'test', 1, 1, '4', '2023-08-15 00:19:46', '2023-08-15 00:19:46')
---
    public function store(Request $request)
    {
        $this->adminOnly();
        $plan = new Plans;
        $plan->name = strip_tags($request->name);
        $plan->price = strip_tags($request->price);
        $plan->limit_items = strip_tags($request->limit_items);


        if(isset($request->subscribe)){
            foreach ($request->subscribe as $key => $value) {
                $plan->$key = strip_tags($value);
            }
        }

        $plan->description = $request->description;
        $plan->features = $request->features;

        $plan->period = $request->period == 'monthly' ? 1 : 2;
        $plan->enable_ordering = $request->ordering == 'enabled' ? 1 : 2;

        $plan->limit_orders = $request->ordering == 'enabled'?$request->limit_orders:0;

        $plan->save();